# 1. Напишите скрипт, который складывает два числа

num1 = 10
num2 = 20

print(num1 + num2)
