# 2. Напишите скрипт, который вычисляет результат деления нацело и выводит частное и остаток.
# Пример:
# x : 4 = 2, остаток 2

num1 = 10
num2 = 4

print(num1 // num2)
