# 3. Реализуйте калькулятор на 4 действия, работающий следующим образом:
# Введите первое число: 35
# Введите второе число: 5
# Результат сложения: 40
# Результат вычитания: 30
# Результат умножения: 165
# Результат деления: 7.0

input_num1 = int(input('Введите первое число: '))
input_num2 = int(input('Введите второе число: '))

print('Результат сложения:', input_num1 + input_num2)
print('Результат вычисления:', input_num1 - input_num2)
print('Результат умножения:', input_num1 * input_num2)
print('Результат деления:', input_num1 / input_num2)
