# 4. Всё является объектом, не так ли?
# Создайте пустые объекты, имеющие типы данных:
# 1. Целое число
# 2. Число с плавающей точкой
# 3. Строка
# 4. Логическая переменная
# Поясните, что вы получили.

# Пояснение:
num = 5  # Переменная num содержит целое число.
print(type(num))

float_num = float(5)  # Переменная float_num содержит число с плавающей точкой.
print(type(float_num))

string = 'Hello, World!'  # Переменная string содержит строку
print(type(string))

boolean = True  # Переменная boolean содержит логическую переменную
print(type(boolean))
