# 5. Ответьте на такие вопросы:
# Что такое int()?
# Что такое print()?
# Что такое print(int())?
# Реализуйте следующий код:
# print(type(print()))
# Какой вывод можно сделать из полученного на экране?

# int() - это целочисленный тип данных
# print() - это встроенная функция в Python, используемая для вывода данных на консоль.
# print(int()) - это вывод данных на консоль, с преобразованием в целочисленный тип данных.
print(type(print))  # это встроенная функция.
