# Задача 2
# Получите первый и последний элемент списка, состоящего из 10 элементов

def get_first_and_last_element():
    my_list = [5, 8, 12, 3, 7, 9, 1, 6, 4, 10]

    first_element = my_list[0]
    last_element = my_list[-1]

    print(f'Первый элемент: {first_element}')
    print(f'Последний элемент: {last_element}')


get_first_and_last_element()
